<template>
    
</template>

<script setup lang="ts">
definePageMeta({
    layout: "home"
});
const quesetionArray = [
    {
        question1: "誰も行ったことないような隠れ家的お店が好き。",
        ans1: [-3, 4, 5, 0, 2, 0, 0, 1, 0],
        ans2: [-2, 3, 4, 0, 1, 0, 0, 1, 0],
        ans3: [1, -2, -3, 0, -1, 0, 0, 0, 0],
        ans4: [2, -4, -5, 0, -2, 0, 0, -1, 0]
    },
    {
        question2: "アートやクリエイティブな雰囲気が好きだ。",
        ans1: [0, 4, 0, -2, 0, 0, 0, 4, 0],
        ans2: [0, 2, 0, -1, 0, 0, 0, 2, 0],
        ans3: [0, -2, 0, 1, 0, 0, 0, -2, 0],
        ans4: [0, -4, 0, 2, 0, 0, 0, -4, 0]
    },
    {
        question3: "お店を選ぶ時は雰囲気よりも美味しい食事が楽しめるかの方が重要だ",
        ans1: [0, 0, 0, 0, -2, -1, 0, -2, 10],
        ans2: [0, 0, 0, 0, -1, 0, 0, -1, 5],
        ans3: [0, 0, 0, 0, 1, 0, 0, 1, -2],
        ans4: [0, 0, 0, 0, 2, 1, 0, 2, -4]
    },
    {
        question4: "新作のメニュー・期間限定のメニューがあると試したくなる",
        ans1: [2, 2, 2, 3, 0, 0, -1, 2, 2],
        ans2: [1, 1, 1, 2, 0, 0, 0, 1, 1],
        ans3: [-1, -1, -1, -1, 0, 0, 0, -1, -1],
        ans4: [-2, -2, -2, -3, 0, 0, 1, -2, -2]
    },
    {
        question5: "福岡のカフェに関するランキングや人気投稿をチェックすることがありますか？",
        ans1: [4, 0, -1, 4, 0, 1, 0, 1, 1],
        ans2: [2, 0, 0, 2, 0, 0, 0, 1, 0],
        ans3: [-2, 0, 1, -2, 0, 0, 0, -1, 0],
        ans4: [-4, 0, 2, -4, 0, -1, 1, -2, -1]
    },
    {
        question6: "コーヒーを選ぶとき、産地や焙煎の深さなど自分だけのこだわりがある",
        ans1: [0, 1, 0, 0, 0, 0, 10, 2, 2],
        ans2: [0, 0, 0, 0, 0, 0, 3, 1, 1],
        ans3: [0, 0, 0, 0, 0, 0, 1, -1, -1],
        ans4: [0, 0, 0, 0, 0, 0, 0, -2, -2]
    },
    {
        question7: "リラックスして本を読めるような落ち着いた雰囲気の空間が好きだ",
        ans1: [0, 0, 0, -4, 4, -4, 0, 2, 0],
        ans2: [0, 0, 0, -2, 2, -2, 0, 1, 0],
        ans3: [0, 0, 0, 2, -2, 2, 0, -1, 0],
        ans4: [0, 0, 0, 4, -4, 4, 0, -2, 0]
    },
    {
        question8: "インスタグラムやSNSで人気のお店によくいく",
        ans1: [2, -4, -4, 4, 0, 1, 0, 0, 0],
        ans2: [1, -2, -2, 2, 0, 0, 0, 0, 0],
        ans3: [-1, 2, 2, -2, 0, 0, 0, 0, 0],
        ans4: [-2, 4, 4, -4, 0, -1, 0, 0, 0]
    },
    {
        question9: "カフェに行く時は友達とおしゃべりするときに行く",
        ans1: [0, 0, 0, 0, -4, 10, 0, 0, 0],
        ans2: [0, 0, 0, 0, -2, 3, 0, 0, 0],
        ans3: [0, 0, 0, 1, 2, 1, 0, -1, 0],
        ans4: [0, 0, 0, 2, 4, 0, 0, -2, 0]
    },
    {
        question10: "お店の外観や建物も含めて全体のデザインが気に入っているお店に足を運ぶことが多い",
        ans1: [0, 4, 2, 2, 0, 0, 0, 4, 0],
        ans2: [0, 2, 1, 1, 0, 0, 0, 3, 0],
        ans3: [0, -1, -1, -1, 0, 0, 0, -2, 0],
        ans4: [0, -2, -2, -2, 0, 0, 0, -4, 0]
    },
    {
        question11: "人の行列や人気度よりも、自分の直感や興味を優先してお店を選ぶことが多い",
        ans1: [0, 4, 4, 2, 0, 0, 0, 3, 0],
        ans2: [0, 3, 3, 1, 0, 0, 0, 1, 0],
        ans3: [0, -1, -1, -1, 0, 0, 0, -1, 0],
        ans4: [0, -2, -2, -2, 0, 0, 0, -2, 0]
    },
    {
        question12: "友達や知り合いが行っているお店に行ってみたいと思う。",
        ans1: [4, -3, 0, 2, 0, 4, 0, 0, 0],
        ans2: [3, -2, 0, 1, 0, 3, 0, 0, 0],
        ans3: [-1, 1, 0, -1, 0, -1, 0, 0, 0],
        ans4: [-2, 2, 0, -2, 0, -2, 0, 0, 0]
    }
    ,
    {
        question13: "お気に入りのお店を見つけると頻繁に通うほうだ",
        ans1: [4, 4, 4, 0, 0, 2, 2, 2, 2],
        ans2: [3, 3, 3, 0, 0, 1, 1, 1, 1],
        ans3: [-1, -1, -1, 0, 0, -1, -1, -1, -1],
        ans4: [-2, -2, -2, 0, 0, -2, -2, -2, -2]
    }
    ,
    {
        question14: "写真を撮る時、背景や雰囲気にもこだわりたいと思いますか？",
        ans1: [0, 2, 2, 5, 0, 0, 0, 2, 0],
        ans2: [0, 1, 1, 3, 0, 0, 0, 1, 0],
        ans3: [0, -1, -1, -2, 0, 0, 0, -1, 0],
        ans4: [0, -2, -2, -4, 0, 0, 0, -2, 0]
    }
    ,
    {
        question15: "カフェでの楽しい会話や笑い声が、良い時間を過ごすための重要な要素だと思いますか？",
        ans1: [0, 0, 0, 0, 0, 6, 0, 0, 2],
        ans2: [0, 0, 0, 0, 0, 4, 0, 0, 1],
        ans3: [0, 0, 0, 0, 0, 1, 0, 0, -1],
        ans4: [0, 0, 0, 0, 0, -2, 0, 0, -2]
    }
    ,
    {
        question16: "福岡のカフェといえば！のような王道なカフェに行くことが多い",
        ans1: [4, 0, -2, -4, 0, 0, -2, -4, 0],
        ans2: [3, 0, -1, -2, 0, 0, -1, -2, 0],
        ans3: [2, 0, 0, -1, 0, 0, 0, 2, 0],
        ans4: [-4, 0, 1, 2, 0, 0, 1, 4, 0]
    }
]

</script>